acc1072.АвтоматизацияИнформированияДебиторов/src/DataProcessors/Аид_ВиртуальныйМенеджер/Аид_ВиртуальныйМенеджер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Аид_ВиртуальныйМенеджер</name>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКлассификации</name>
    <type>
      <types>CatalogRef.Аид_ВариантыКлассификацииЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

acc1072.АвтоматизацияИнформированияДебиторов/src/InformationRegisters/Аид_ДатаАктуальностиДЗ/Аид_ДатаАктуальностиДЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аид_ДатаАктуальностиДЗ</name>
  <resources>
    <name>ДатаАктуальностиДЗ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

acc1072.АвтоматизацияИнформированияДебиторов/src/DataProcessors/Аид_ВиртуальныйМенеджер/Forms/ФормаДатаАктуальностиДЗ/Module.bsl
&НаСервере
Процедура ДатаАктуальностиДЗПриИзмененииНаСервере()
	ЗаписьДатыАктуальности = РегистрыСведений.Аид_ДатаАктуальностиДЗ.СоздатьМенеджерЗаписи();
	ЗаписьДатыАктуальности.Организация = Справочники.Организации.ПустаяСсылка();
	ЗаписьДатыАктуальности.ДатаАктуальностиДЗ = ДатаАктуальностиДЗ;
	ЗаписьДатыАктуальности.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктуальностиДЗПриИзменении(Элемент)
	ДатаАктуальностиДЗПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаАктуальностиДЗ = ПолучитьДатуАктуальностиДЗ();
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуАктуальностиДЗ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	        |	Аид_ДатаАктуальностиДЗ.ДатаАктуальностиДЗ КАК ДатаАктуальностиДЗ
	        |ИЗ
	        |	РегистрСведений.Аид_ДатаАктуальностиДЗ КАК Аид_ДатаАктуальностиДЗ
	        |ГДЕ
	        |	Аид_ДатаАктуальностиДЗ.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ДатаАктуальностиДЗ;
	КонецЕсли;
	Возврат Дата(1, 1, 1);
КонецФункции
